app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"  ORDER BY created_at DESC
---
  def index
  	@pins = Pin.order("created_at DESC")

INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Second Pin"], ["description", "Teste"], ["user_id", 1], ["created_at", "2015-11-25 02:43:32.649052"], ["updated_at", "2015-11-25 02:43:32.649052"]]
---
  def create
  	@pin = current_user.pins.build(pin_params)

  	if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "oaoaisuoiausouaaa!"], ["updated_at", "2015-11-17 22:15:23.411533"], ["id", 1]]
---
  def update
  	if @pin.update(pin_params)

DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]
---
  def destroy
  	@pin.destroy

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 31]]
---
  def find_pin
  	@pin = Pin.find(params[:id])